Tekla Open API Reference for Tekla Structures 2025
PolygonWeld.Polygon Property
 The polygon for the polygon weld.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polygon Polygon { get; set; }
Public Property Polygon As Polygon
	Get
	Set
Property Value
Type: Polygon
See Also
Reference
PolygonWeld Class
Tekla.Structures.Model Namespace